tap "homebrew/bundle"
tap "homebrew/services"
brew "awscli"
brew "bat"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "go"
brew "lazygit"
brew "luarocks"
brew "neovim"
brew "python@3.9"
brew "ripgrep"
brew "stow"
brew "tmux"
brew "tree"
brew "watchman"
brew "zoxide"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "wezterm"
