tap "macos-fuse-t/cask"
brew "bat"
brew "btop"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "go"
brew "lazygit"
brew "luarocks"
brew "neovim"
brew "python@3.9"
brew "ripgrep"
brew "rustup"
brew "stow"
brew "tmux"
brew "tree"
brew "watchman"
brew "zoxide"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "fuse-t"
cask "ghostty"
cask "visual-studio-code"
vscode "dbaeumer.vscode-eslint"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "mikestead.dotenv"
vscode "rust-lang.rust-analyzer"
